
// お知らせの情報
const newsListArray = [
    { category: 'お知らせ', date: '2025-12-24', title: '冬季休業期間のお知らせ' },
    { category: 'お知らせ', date: '2025-10-08', title: 'マンションリフォーム施工事例を追加しました' },
    { category: 'お得な情報', date: '2025-08-03', title: '水回りリフォーム相談会のご案内' },
    { category: 'お知らせ', date: '2025-05-20', title: '営業時間が変更になります' },
    { category: 'お得な情報', date: '2025-05-20', title: '春のリフォームキャンペーン' },
    { category: 'お得な情報', date: '2025-04-10', title: '【補助金活用】窓断熱リフォーム相談会スタート' },
    { category: 'お知らせ', date: '2025-03-15', title: '一級建築士による無料相談会の空き状況' },
    { category: 'お得な情報', date: '2025-02-01', title: '新生活応援！内装壁紙貼り替えフェア！' },
    { category: 'お知らせ', date: '2025-01-10', title: '公式サイトをリニューアルいたしました' }
];


// 施工事例の情報を配列化
const caseArray =
    [{ title: "猫とのびのび暮らす家", category: "戸建て", owner: "福岡市N様", img: "case1.jpg", alt: "福岡市のリフォーム事例。壁にキャットタワーがつけられており、黒猫がくつろいでいる。" },
    { title: "三世代で囲む食卓", category: "戸建て", owner: "福岡市T様", img: "case2.jpg", alt: "福岡市のリフォーム事例。白い部屋に机と椅子がある。机の上には食器類がおかれている。" },
    { title: "水回りまとめてリフォーム", category: "集合住宅", owner: "古賀市S様", img: "case3.jpg", alt: "古賀市のリフォーム事例。白い壁の部屋。ブラウンの引き出しがある大きな洗面台がある。窓からは青空が見える。" }]
